bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAME51_DFP/1.1.139/atdf/ATSAME51N20A.atdf
        <module name="FREQM" id="U2257" version="1.1.0">
          <instance name="FREQM">
            <register-group name="FREQM" name-in-module="FREQM" address-space="base" offset="0x40002C00"/>
            <parameters>
              <param name="GCLK_ID_MSR" value="5" caption="Index of measure generic clock"/>
              <param name="GCLK_ID_REF" value="6" caption="Index of reference generic clock"/>
              <param name="INSTANCE_ID" value="11"/>
            </parameters>
          </instance>
        </module>
        <module name="GCLK" id="U2122" version="1.2.0">
          <instance name="GCLK">
            <register-group name="GCLK" name-in-module="GCLK" address-space="base" offset="0x40001C00"/>
            <signals>
              <signal group="IO" index="0" function="M" pad="PA30"/>
              <signal group="IO" index="0" function="M" pad="PB14"/>
              <signal group="IO" index="0" function="M" pad="PA14"/>
              <signal group="IO" index="0" function="M" pad="PB22"/>
              <signal group="IO" index="1" function="M" pad="PB15"/>
              <signal group="IO" index="1" function="M" pad="PA15"/>
              <signal group="IO" index="1" function="M" pad="PB23"/>
              <signal group="IO" index="1" function="M" pad="PA27"/>
              <signal group="IO" index="2" function="M" pad="PA16"/>
              <signal group="IO" index="2" function="M" pad="PB16"/>
              <signal group="IO" index="3" function="M" pad="PA17"/>
              <signal group="IO" index="3" function="M" pad="PB17"/>
              <signal group="IO" index="4" function="M" pad="PA10"/>
              <signal group="IO" index="4" function="M" pad="PB10"/>
              <signal group="IO" index="4" function="M" pad="PB18"/>
              <signal group="IO" index="5" function="M" pad="PA11"/>
              <signal group="IO" index="5" function="M" pad="PB11"/>
              <signal group="IO" index="5" function="M" pad="PB19"/>
              <signal group="IO" index="6" function="M" pad="PB12"/>
              <signal group="IO" index="6" function="M" pad="PB20"/>
              <signal group="IO" index="7" function="M" pad="PB13"/>
              <signal group="IO" index="7" function="M" pad="PB21"/>
            </signals>
            <parameters>
              <param name="GENCTRL0_RESETVALUE" value="106" caption="Default specific reset value for generator 0"/>
              <param name="GENDIV_BITS" value="16"/>
              <param name="GEN_BITS" value="4"/>
              <param name="GEN_NUM" value="12" caption="Number of Generic Clock Generators"/>
              <param name="GEN_NUM_MSB" value="11" caption="Number of Generic Clock Generators - 1"/>
              <param name="GEN_SOURCE_NUM_MSB" value="8" caption="Number of Generic Clock Sources - 1"/>
              <param name="IO_NUM" value="8" caption="Number of Generic Clock I/Os"/>
              <param name="NUM" value="48" caption="Number of Generic Clock Users"/>
              <param name="SOURCE_BITS" value="4"/>
              <param name="SOURCE_NUM" value="9" caption="Number of Generic Clock Sources"/>
              <param name="INSTANCE_ID" value="7"/>
            </parameters>
          </instance>
        </module>
        <module name="HMATRIXB" id="I7638" version="2.1.4">
          <instance name="HMATRIX">
            <register-group name="HMATRIX" name-in-module="HMATRIXB" address-space="base" offset="0x4100C000"/>
            <parameters>
              <param name="MASTER_NUM" value="8"/>
              <param name="MASTER_CM4_S" value="0"/>
              <param name="MASTER_CMCC" value="1"/>
              <param name="MASTER_PICOP_MEM" value="2"/>
              <param name="MASTER_PICOP_IO" value="3"/>
              <param name="MASTER_DMAC_DTWR" value="4"/>
              <param name="MASTER_DMAC_DTRD" value="5"/>
              <param name="MASTER_ICM" value="6"/>
              <param name="MASTER_DSU" value="7"/>
              <param name="SLAVE_NUM" value="14"/>
              <param name="SLAVE_FLASH" value="0"/>
              <param name="SLAVE_FLASH_ALT" value="1"/>
              <param name="SLAVE_SEEPROM" value="2"/>
              <param name="SLAVE_RAMCM4S" value="3"/>
              <param name="SLAVE_RAMPPPDSU" value="4"/>
              <param name="SLAVE_RAMDMAWR" value="5"/>
              <param name="SLAVE_RAMDMACICM" value="6"/>
              <param name="SLAVE_HPB0" value="7"/>
              <param name="SLAVE_HPB1" value="8"/>
              <param name="SLAVE_HPB2" value="9"/>
              <param name="SLAVE_HPB3" value="10"/>
              <param name="SLAVE_SDHC0" value="12"/>
              <param name="SLAVE_QSPI" value="14"/>
              <param name="SLAVE_BKUPRAM" value="15"/>
              <param name="INSTANCE_ID" value="38"/>
            </parameters>
          </instance>
        </module>
        <module name="ICM" id="U2010" version="1.2.0">
          <instance name="ICM">
            <register-group name="ICM" name-in-module="ICM" address-space="base" offset="0x42002C00"/>
            <parameters>
              <param name="INSTANCE_ID" value="75"/>
            </parameters>
          </instance>
        </module>
        <module name="I2S" id="U2224" version="2.0.0">
          <instance name="I2S">
            <register-group name="I2S" name-in-module="I2S" address-space="base" offset="0x43002800"/>
            <signals>
              <signal group="FS" index="0" function="J" pad="PA09" ioset="1"/>
              <signal group="FS" index="0" function="J" pad="PA20" ioset="2"/>
              <signal group="FS" index="1" function="J" pad="PA23" ioset="2"/>
              <signal group="FS" index="1" function="J" pad="PB11" ioset="1"/>
              <signal group="MCK" index="0" function="J" pad="PA08" ioset="1"/>
              <signal group="MCK" index="0" function="J" pad="PB17" ioset="2"/>
              <signal group="MCK" index="1" function="J" pad="PB13" ioset="1"/>
              <signal group="SCK" index="0" function="J" pad="PA10" ioset="1"/>
              <signal group="SCK" index="0" function="J" pad="PB16" ioset="2"/>
              <signal group="SCK" index="1" function="J" pad="PB12" ioset="1"/>
              <signal group="SDI" function="J" pad="PA22" ioset="2"/>
              <signal group="SDI" function="J" pad="PB10" ioset="1"/>
              <signal group="SDO" function="J" pad="PA11" ioset="1"/>
              <signal group="SDO" function="J" pad="PA21" ioset="2"/>
            </signals>
            <parameters>
              <param name="CLK_NUM" value="2" caption="Number of clock units"/>
              <param name="GCLK_ID_0" value="43" caption="Index of Generic Clock 0"/>
              <param name="GCLK_ID_1" value="44" caption="Index of Generic Clock 1"/>
              <param name="DMAC_ID_RX_0" value="76"/>
              <param name="DMAC_ID_RX_1" value="77"/>
              <param name="DMAC_ID_TX_0" value="78"/>
              <param name="DMAC_ID_TX_1" value="79"/>
              <param name="MAX_SLOTS" value="8" caption="Max number of data slots in frame"/>
              <param name="MAX_WL_BITS" value="32" caption="Max number of bits in data samples"/>
              <param name="SER_NUM" value="2" caption="Number of serializers"/>
              <param name="INSTANCE_ID" value="106"/>
            </parameters>
          </instance>
        </module>
