bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAME51_DFP/1.1.139/atdf/ATSAME51N20A.atdf
      <value-group name="PDEC_CTRLA__MODE">
        <value name="QDEC" caption="QDEC operating mode" value="0"/>
        <value name="HALL" caption="HALL operating mode" value="1"/>
        <value name="COUNTER" caption="COUNTER operating mode" value="2"/>
      </value-group>
      <value-group name="PDEC_CTRLBCLR__CMD">
        <value name="NONE" caption="No action" value="0"/>
        <value name="RETRIGGER" caption="Force a counter restart or retrigger" value="1"/>
        <value name="UPDATE" caption="Force update of double buffered registers" value="2"/>
        <value name="READSYNC" caption="Force a read synchronization of COUNT" value="3"/>
        <value name="START" caption="Start QDEC/HALL" value="4"/>
        <value name="STOP" caption="Stop QDEC/HALL" value="5"/>
      </value-group>
      <value-group name="PDEC_CTRLBSET__CMD">
        <value name="NONE" caption="No action" value="0"/>
        <value name="RETRIGGER" caption="Force a counter restart or retrigger" value="1"/>
        <value name="UPDATE" caption="Force update of double buffered registers" value="2"/>
        <value name="READSYNC" caption="Force a read synchronization of COUNT" value="3"/>
        <value name="START" caption="Start QDEC/HALL" value="4"/>
        <value name="STOP" caption="Stop QDEC/HALL" value="5"/>
      </value-group>
      <value-group name="PDEC_EVCTRL__EVACT">
        <value name="OFF" caption="Event action disabled" value="0"/>
        <value name="RETRIGGER" caption="Start, restart or retrigger on event" value="1"/>
        <value name="COUNT" caption="Count on event" value="2"/>
      </value-group>
      <value-group name="PDEC_PRESC__PRESC">
        <value name="DIV1" caption="No division" value="0"/>
        <value name="DIV2" caption="Divide by 2" value="1"/>
        <value name="DIV4" caption="Divide by 4" value="2"/>
        <value name="DIV8" caption="Divide by 8" value="3"/>
        <value name="DIV16" caption="Divide by 16" value="4"/>
        <value name="DIV32" caption="Divide by 32" value="5"/>
        <value name="DIV64" caption="Divide by 64" value="6"/>
        <value name="DIV128" caption="Divide by 128" value="7"/>
        <value name="DIV256" caption="Divide by 256" value="8"/>
        <value name="DIV512" caption="Divide by 512" value="9"/>
        <value name="DIV1024" caption="Divide by 1024" value="10"/>
      </value-group>
      <value-group name="PDEC_PRESCBUF__PRESCBUF">
        <value name="DIV1" caption="No division" value="0"/>
        <value name="DIV2" caption="Divide by 2" value="1"/>
        <value name="DIV4" caption="Divide by 4" value="2"/>
        <value name="DIV8" caption="Divide by 8" value="3"/>
        <value name="DIV16" caption="Divide by 16" value="4"/>
        <value name="DIV32" caption="Divide by 32" value="5"/>
        <value name="DIV64" caption="Divide by 64" value="6"/>
        <value name="DIV128" caption="Divide by 128" value="7"/>
        <value name="DIV256" caption="Divide by 256" value="8"/>
        <value name="DIV512" caption="Divide by 512" value="9"/>
        <value name="DIV1024" caption="Divide by 1024" value="10"/>
      </value-group>
    </module>
    <module name="PM" id="U2406" version="1.0.0" caption="Power Manager">
      <register-group name="PM" caption="Power Manager">
        <register name="CTRLA" offset="0x0" rw="RW" size="1" initval="0x00" caption="Control A">
          <bitfield name="IORET" caption="I/O Retention" mask="0x4"/>
        </register>
        <register name="SLEEPCFG" offset="0x1" rw="RW" size="1" initval="0x02" caption="Sleep Configuration">
          <bitfield name="SLEEPMODE" caption="Sleep Mode" mask="0x7" values="PM_SLEEPCFG__SLEEPMODE"/>
        </register>
        <register name="INTENCLR" offset="0x4" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear">
          <bitfield name="SLEEPRDY" caption="Sleep Mode Entry Ready Enable" mask="0x1"/>
        </register>
        <register name="INTENSET" offset="0x5" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set">
          <bitfield name="SLEEPRDY" caption="Sleep Mode Entry Ready Enable" mask="0x1"/>
        </register>
        <register name="INTFLAG" offset="0x6" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="Interrupt Flag Status and Clear">
          <bitfield name="SLEEPRDY" caption="Sleep Mode Entry Ready" mask="0x1"/>
        </register>
        <register name="STDBYCFG" offset="0x8" rw="RW" size="1" initval="0x00" caption="Standby Configuration">
          <bitfield name="RAMCFG" caption="Ram Configuration" mask="0x3" values="PM_STDBYCFG__RAMCFG"/>
          <bitfield name="FASTWKUP" caption="Fast Wakeup" mask="0x30" values="PM_STDBYCFG__FASTWKUP"/>
        </register>
        <register name="HIBCFG" offset="0x9" rw="RW" size="1" initval="0x00" caption="Hibernate Configuration">
          <bitfield name="RAMCFG" caption="Ram Configuration" mask="0x3" values="PM_HIBCFG__RAMCFG"/>
          <bitfield name="BRAMCFG" caption="Backup Ram Configuration" mask="0xC" values="PM_HIBCFG__BRAMCFG"/>
        </register>
        <register name="BKUPCFG" offset="0xA" rw="RW" size="1" initval="0x00" caption="Backup Configuration">
          <bitfield name="BRAMCFG" caption="Ram Configuration" mask="0x3" values="PM_BKUPCFG__BRAMCFG"/>
        </register>
        <register name="PWSAKDLY" offset="0x12" rw="RW" size="1" initval="0x00" caption="Power Switch Acknowledge Delay">
          <bitfield name="DLYVAL" caption="Delay Value" mask="0x7F"/>
          <bitfield name="IGNACK" caption="Ignore Acknowledge" mask="0x80"/>
        </register>
      </register-group>
      <value-group name="PM_SLEEPCFG__SLEEPMODE">
        <value name="IDLE" caption="CPU, AHBx, and APBx clocks are OFF" value="2"/>
        <value name="STANDBY" caption="All Clocks are OFF" value="4"/>
        <value name="HIBERNATE" caption="Backup domain is ON as well as some PDRAMs" value="5"/>
        <value name="BACKUP" caption="Only Backup domain is powered ON" value="6"/>
        <value name="OFF" caption="All power domains are powered OFF" value="7"/>
      </value-group>
      <value-group name="PM_STDBYCFG__RAMCFG">
        <value name="RET" caption="All the system RAM is retained" value="0"/>
        <value name="PARTIAL" caption="Only the first 32Kbytes of the system RAM is retained" value="1"/>
        <value name="OFF" caption="All the system RAM is turned OFF" value="2"/>
      </value-group>
      <value-group name="PM_HIBCFG__RAMCFG">
        <value name="RET" caption="All the system RAM is retained" value="0"/>
        <value name="PARTIAL" caption="Only the first 32Kbytes of the system RAM is retained" value="1"/>
        <value name="OFF" caption="All the system RAM is turned OFF" value="2"/>
      </value-group>
